Revit 2026 API

# ViewIsolateCategoriesTemporary Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void IsolateCategoriesTemporary(
	ICollection<ElementId> elementIds
)
```
```vb
Public Sub IsolateCategoriesTemporary (
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
void IsolateCategoriesTemporary(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member IsolateCategoriesTemporary :
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

elementIds ICollectionElementId

#### Reference

View Class

Autodesk.Revit.DB Namespace